cloud.org
#+TITLE: emacs-based secure cloud storage for text files
#+AUTHOR: Oleg Shalaev
#+EMAIL:  oleg@chalaev.com
#+LaTeX_HEADER: \usepackage[russian,english]{babel}
#+LATEX_HEADER: \usepackage[letterpaper,hmargin={1.5cm,1.5cm},vmargin={1.3cm,2cm},nohead,nofoot]{geometry}

Uses ~macros.el~, ~functions.el~, ~file-functions.el~, and ~logging.el~ from the [[https://notabug.org/shalaev/lisp-goodies][lisp-goodies]] project.

Github vs Emacs: since ~github~
1. does not understand ~org-mode~ internal links,
2. does not show calculation results from ~org~ files and
3. can not hide selected sections (thus making the web page too long),
consider opening this file in ~emacs~ instead of watching it online.

* Symmetric (en/de)cryption
All hosts (computers) are treated identically – there is no "main" host. This is why we use symmetric encryption
with automatically generated password. 
For (en/de)cryption, emacs will call shell commands similar to
#+BEGIN_SRC shell
gpg --pinentry-mode loopback --passphrase "somepass" -o /mnt/cloud/abc.gpg --symmetric ~/myFile.txt
gpg --pinentry-mode loopback --passphrase "somepass" -o ~/myFile.txt --decrypt /mnt/cloud/abc.gpg
#+END_SRC

* Initialization
Although [[https://stallman.org/][Stallman]] recommends not to use ~CL~, for now I am still requiring it.
** Local configuration
*** variables (configuration parameters)
The variables with the names starting with "cloud-" should probably be kept global; the others will be "localized".

=cloud-file-hooks= is used for special files (e.g., diary or bookmarks);
When those are copied from the cloud to the local hard drive, one should call, e.g., =diary-view-entries= or =bookmark-load=:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; generated from cloud.org
(defvar password nil); to be read from config or generated
(defvar number-of-CPU-cores 1)
(defvar cloud-file-hooks nil "for special files treatment")
#+END_SRC
← for example, after we have updated local ~emacs-diary~ file from the cloud, we may want to re-scan it.

#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defvar upload-queue nil "names of edited files")
(defvar added-files nil "newly clouded files")
#+END_SRC

From time to time (e.g., when we =M-x cloud-sync=)  we synchronize local information
with the remote file whose (secret) name is stored in =remote/files=:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defvar remote/files nil "3-symbol DB name on the server, e.g., WzT")
(defvar localhost (system-name))
(defvar ~ (file-name-as-directory(expand-file-name "~")))
(defvar remote-directory  "/mnt/cloud/")
#+END_SRC
← for portability it is better to avoid backslashes in path names.

#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defvar /tmp/cloud/ (file-name-as-directory (make-temp-file "cloud." t)))
(defun remote/files() remote/files)
(defun remote-directory() remote-directory)
(defun remote-files() (concat (remote-directory) remote/files ".gpg"))
(defun history() (concat (remote-directory) "history"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defvar emacs-d "~/.emacs.d/")
(defvar cloud-was-connected t "normally t, nill when there was no connection")
#+END_SRC
← ~cloud-was-connected~ is set to ~nil~ when ~(cloud-sync)~ fails, and is set to ~t~ once =(read-fileDB)= succeeds.

Similarly to how they do it in ~JavaScript~, let me call the following functions "dynamic variables":
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defun local-dir() (concat emacs-d "cloud/"))
(defun cloud-mk() (concat (local-dir) "cloud.mk"))
(defun lock-dir() (concat (remote-directory) "now-syncing/"))
(defun image-passes() (concat (local-dir) "individual.passes"))
(defun local/() (concat (local-dir) localhost "/"))
(defun local/log() (concat (local/) "log"))
#+END_SRC

Instead of storing configuration in =~/.emacs= I prefer to store it in a separate file:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defun local/config() (concat (local-dir) localhost "/config"))
#+END_SRC
This is because
1. sometimes the code will update its configuration, and
2. in this way configuration data is more separated from other ~elisp~ programs.

*** creating (only once, during the first run)
Before we start for the very first time, when cloud directory is inexistent or empty, 
we create the password for encryption by =(cloud-init)=:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun cloud-init() "initializes cloud directory and generates password -- runs only once"
(clog :info "atempting to create new configuration for this host")
;;(when (yes-or-no-p "Is cloud mounted?")
;;(setf remote-directory (read-string "cloud directory=" remote-directory))
(ifn (member (safe-mkdir remote-directory) '(:exists t))
(clog :error "could not create/access directory %s" remote-directory)
#+END_SRC
For safety reasons refusing to initialize a directory already containing encrypted files:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(if (directory-files remote-directory nil "^.\+.gpg$" t)
    (clog :error "please clean the directory %s before asking me to initialize it" remote-directory)
(clog :info "creating (main) remote file DB in unused directory %s" remote-directory)
(ifn-set ((remote/files (new-file-name remote-directory)))
  (clog :error "could not create DB file in the directory %s" remote-directory)
#+END_SRC
Generating random password and saving it in the local configuration file:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(setf password (rand-str 9))
#+END_SRC
– one password for all text files – 
for now this software is designed for single person only, and I do not see why should I use individual passwords for different
text files. 

#+begin_note
I already use individual passwords for images so (from the technical point of view) it is easy to use
individuall passwords for some (or all) text files ← might facilitate gradual password replacement.
#+end_note

The concept "one password for many text files" might be changed later if I ever upgrade the code for sharing files within a group of people;
but if this happens, I will probably have to abandon symmetric encryption and deal with public/private keys.
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(ifn (member (safe-mkdir (local-dir)) '(:exists t))
  (clog :error "could not create/acess directory %s" (local-dir))
(write-conf)
(clog :info "use M-x cloud-add in the dired to cloud important files and directories" ))))))
#+END_SRC

*** reading and writing
By default we assume that our configuration parameters have a string value. There are exceptions:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defvar numerical-parameters '("number-of-CPU-cores"))
(defvar lists-of-strings '("junk-extensions" "ignored-dirs"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun format-conf(CP)
(cond
  ((member CP numerical-parameters) (format "%s=%d" CP (symbol-value(intern CP))))
  ((member CP lists-of-strings) (format "%s=%s" CP
(apply #'concat (mapcar #'(lambda(item) (format "%s " item)) (sort (symbol-value(intern CP)) #'string<)))))
  (t (format "%s=%s" CP (symbol-value(intern CP))))))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.el
(ert-deftest format-conf()
(let ((numerical-parameters '("number-of-CPU-cores"))
      (number-of-CPU-cores 123))
  (should (string= "number-of-CPU-cores=123"
     (format-conf "number-of-CPU-cores")))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun write-conf()
(clog :debug "starting write-conf")
(with-temp-file (local/config)
(mapcar #'(lambda(CP) (insert(format-conf CP)) (newline)) 
  '("remote-directory" "junk-extensions" "ignored-dirs" "remote/files" "number-of-CPU-cores" "password")))
(clog :debug "ended write-conf") t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun read-conf* (file-name)
  "reads configuration file"
(with-temp-buffer
(safe-insert-file (local/config))
  (let (res str)
    (while (< 0 (length (setf str (read-line))))
     (if (string-match "^\\(\\ca+\\)=\\(\\ca+\\)$" str)
	 (push (cons (match-string 1 str) (match-string 2 str)) res)
       (clog :error "garbage string in configuration file: %s" str)))
    res)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun read-conf()
  "reads configuration file"
(let ((conf (read-conf* (local/config))))
(ifn conf (clog :error "refuse to work until you specify 3-symbol contents name \"remote/files\" in %s" (local/config))
(dolist (CP (mapcar #'car conf))
(clog :debug "read-conf(%s)" CP)
  (setcdr (assoc CP conf)
    (cond
((member CP numerical-parameters) (string-to-number (cdr (assoc CP conf))))
((member CP lists-of-strings)  (split-string (cdr (assoc CP conf))))
(t (car (split-string (cdr (assoc CP conf))))))))
(clog :debug "done with read-conf")
conf)))
;; 2020-11-20 (car (split-string "/mnt/cloud/"))
#+END_SRC

** Host/Action/File information
