generated/variables.el
;; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-
;; generated from cloud.org
(defvar password nil); to be read from config or generated
(defvar number-of-CPU-cores 1)
(defvar cloud-file-hooks nil "for special files treatment")

(defvar upload-queue nil "names of edited files")
(defvar added-files nil "newly clouded files")

(defvar remote/files nil "3-symbol DB name on the server, e.g., WzT")
(defvar localhost (system-name))
(defvar ~ (file-name-as-directory(expand-file-name "~")))
(defvar remote-directory  "/mnt/cloud/")

(defvar /tmp/cloud/ (file-name-as-directory (make-temp-file "cloud." t)))
(defun remote/files() remote/files)
(defun remote-directory() remote-directory)
(defun remote-files() (concat (remote-directory) remote/files ".gpg"))
(defun history() (concat (remote-directory) "history"))

(defvar emacs-d "~/.emacs.d/")
(defvar cloud-was-connected t "normally t, nill when there was no connection")

(defun local-dir() (concat emacs-d "cloud/"))
(defun cloud-mk() (concat (local-dir) "cloud.mk"))
(defun lock-dir() (concat (remote-directory) "now-syncing/"))
(defun image-passes() (concat (local-dir) "individual.passes"))
(defun local/() (concat (local-dir) localhost "/"))
(defun local/log() (concat (local/) "log"))

(defun local/config() (concat (local-dir) localhost "/config"))

(defvar numerical-parameters '("number-of-CPU-cores"))
(defvar lists-of-strings '("junk-extensions" "ignored-dirs"))
