cloud.org
** WebDav
=WebDav= is much slower than =ssh=, but it should be ok for file synchronization.
To mount ~yandex~ or ~pcloud~ to local directories ~/mnt/yd/~ and ~/mnt/pc~ I need three files:
~/etc/fstab~, ~/etc/davfs2/davfs2.conf~, and ~/etc/davfs2/secrets~
#+BEGIN_SRC 
# /etc/fstab
https://webdav.yandex.ru        /mnt/yd	davfs   user,noauto,file_mode=0664,dir_mode=2775,x-systemd.device-timeout=20 0 0
https://webdav.pcloud.com	/mnt/pc	davfs	user,noauto,uid=shalaev,gid=shalaev,file_mode=0664,dir_mode=2775,x-systemd.device-timeout=20 0 0
#+END_SRC
where ~shalaev~ is my user name and group name; you must replace it with yours.

#+BEGIN_SRC
# /etc/davfs2/davfs2.conf
dav_user        davfs2
dav_group       davfs2
use_locks	0
cache_dir       /var/cache/davfs2 # system wide cache
cache_size      5000              # MiByte
delay_upload	0
#+END_SRC

#+BEGIN_SRC
# /etc/davfs2/secrets
/mnt/yd	myYandexLogin		password
/mnt/pc	myPCloudLogin		password
#+END_SRC

** FTP
Somehow I am not aware of /reliable/ way of mounting an ~ftp~ server to a directory in linux;
~emacs~ also seems to be bad in estsblishing ~ftp~ connections.
May be developers think that ~ftp~ is obsolete and ignore it;
personally I don't see anything wrong with it, especially when an ~ftp~ connection is established using SSL-encryption.

Probably the best way to improve FTP-support in emacs would be to write an eLisp-wrapper for [[http://lftp.yar.ru][lftp]] command.

* Remote file DB
This file stores [[Host/Action/File information][Host/Action/File information]] on the server.
** Writing
*** The first line: list of all hostnames
←  without quotes, separated by spaces.

In the following, ~DBname~ is the name of _decrypted_ remote file DB:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun write-all (DBname)
  (with-temp-file DBname
(print-hosts)
#+END_SRC
Probably I should *not* write the file if both =upload-queue= and =added-files= are nil.

The next block of lines contains information about pending [[Actions][actions]] →

*** Pending actions
In this block, every line is has the following fields (columns):
1. Time stamp,
2. (integer) action ID,
3. (integer) number of arguments for this action (one column),
4. [arguments+] (several columns),
5. hostnames, where the action has to be performed (several columns).
   Gets updated by =cloud-host-add= and =cloud-host-forget=.

The order of actions is important! For example, imagine that
I renamed or moved a file twice; the order of these actions on a remote host should be the as on the local one:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(print-actions)
#+END_SRC
Pending actions block is ended by an empty line separating it from the rest of the file:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(newline)
#+END_SRC

*** List of clouded files
This is the last (and, usually, the largest) block of lines.
Here every line corresponds to one file:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(dolist (file-record file-DB)
  (insert (format-file file-record)) (newline))
(setf removed-files nil) t))
#+END_SRC
← Also =removed-files= is set to =nil= in =cloud-sync=; probably it's enough to reset it only there.

** Parsing
*** list of host names
The function =read-all= (returns =nil=) reads (previously decrypted) [[Host/Action/File information][host/action/file information]]:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun read-all(DBname)
  "reads content (text) file into the database file-DB"
  (temp-open DBname
  (let (str)
(needs-set
 ((cloud-hosts
  (split-string (setf str (read-line)))
  (clog :error "invalid first line in the remote file DB %s" DBname)))
#+END_SRC
In case =read-all= is launched on an unknown computer
(that is, its hostname is not yet mentioned in the first line of the file =DBname=),
it is automatically added to the cloud network:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(unless (member localhost cloud-hosts) (cloud-host-add))
#+END_SRC

*** list of pending actions
The concept of actions is explained in the [[Actions][corresponding section]].

Keep reading one action after another until we encounter an empty line:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(while (< 0 (length (setf str (read-line))))
(clog :debug "action string=%s" str)
(when-let ((AA (parse-action str)) (AID (car AA)) (action (cdr AA)))
  (ifn (member localhost (aref action i-hostnames))
      (clog :info "this host is unaffected by action %s" AID)
    (if (perform action (aref action i-hostnames))
	(clog :info "sucessfully performed action %s" AID)
      (clog :error " action %s failed, will NOT retry it" AID))
#+END_SRC
← even if the action failed, we wash our hands and not retry it.
If the action is still pending on some hosts, we will store it in =remote-actions=
which is going later to be saved into the [[Contents file][remote file DB]]:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(when (drop (aref action i-hostnames) localhost)
  (end-push action remote-actions)))))
#+END_SRC

An empty line ends the action reading loop;
the next thing to do is to read/parse the files' block of lines.

*** list of (clouded) files
For files that need to be (up/down)loaded (to/from) the cloud =(read-fileDB)= forms ~cloud.mk~
which can be fed to GNU make as =make --jobs=N -f cloud.mk=, where ~jobs~ parameter ~N~ is the (configurable) number of CPU cores.
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(needs ((CDFs
#+END_SRC
← =CDFs= will contain the data about the files in the remote directory.

Our ~.gpg~ files are named as  ~XYZ.gpg~; the next line cuts the extension  ~.gpg~ away:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
 (mapcar #'(lambda(s) (replace-regexp-in-string "....$" "" s))
      (directory-files remote-directory nil "...\...." t)) (clog :error "can not read %s" remote-directory)))
(while(< 10 (length (setf str (read-line))))
(when-let((CF (str-to-DBrec str)))
#+END_SRC
Ideally every file mentioned in =file-DB= should exist on a local hard disk.
In reality either file, the local one, or the remote one, or both, might be absent,
and we have to address all of these situations:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(let* ((FN (plain-name CF))
       (CN (aref CF cipher))
       (remote-file-exists (member CN CDFs))
       (local-file-rec (or (cloud-locate-FN FN)
(and (not (member FN removed-files))
(when-let ((LF (get-file-properties* FN)))
        (aset LF cipher (aref CF cipher))
        (push LF file-DB)
        LF)))))
(cond
((not (or local-file-rec remote-file-exists))
 (clog :error "forgetting file %s which is marked as clouded but is neither on local disk nor in the cloud" FN)
 (drop file-DB CF))
((or
 (and (not local-file-rec) remote-file-exists)
 (and local-file-rec remote-file-exists (time< (aref local-file-rec mtime) (aref CF mtime))))
(when (and local-file-rec remote-file-exists)
  (clog :debug "read-all/download: %s(%s) is older than %s.gpg(%s)"
  (aref local-file-rec plain) (TS(aref local-file-rec mtime))
  (aref CF cipher) (TS(aref CF mtime))))
#+END_SRC
=download= queues the file for downloading from the cloud (by updating the [[Creating make file][make file]]):
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(if local-file-rec
   (aset local-file-rec mtime (aref CF mtime))
   (push CF file-DB))
(let*((DN(file-name-directory(aref CF plain))) (mkdir(safe-mkdir DN)))
(if(or(car mkdir)(eql :exists(cdr mkdir)))
(download CF)
(clog :error "could not mkdir %s" DN))))
((or
 (and local-file-rec remote-file-exists (time< (aref CF mtime) (aref local-file-rec mtime)))
 (and local-file-rec (not remote-file-exists)))
(when (and local-file-rec remote-file-exists)
  (clog :debug "read-all/upload: local %s(%s) is younger than %s.gpg(%s)"
  (aref local-file-rec plain) (TS(aref local-file-rec mtime))
  (aref CF cipher) (TS(aref CF mtime))))
(upload CF))))))
t)))))
#+END_SRC
← similarly, =upload= queues the file for uploading to the cloud.

At this point we ended up parsing the list of files.
=(defun read-all ...)= ends here.

* On saving files in emacs
When the file is saved in emacs (=C-x s=), we mark it so that it is going
to be uploaded to the cloud when the user calls =cloud-sync= next time:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun touch (FN)
"called when the file named FN is changed"
(when (and FN (stringp FN))
  (when-let ((file-data (cloud-locate-FN FN)))
    (aset file-data mtime (current-time))
    (clog :debug "touch/upload: %s(%s)" FN (TS(aref file-data mtime)))
    (upload file-data) t)))
(defun on-current-buffer-save()
  (when-let ((FN (buffer-file-name)))
    (and (auto-add-file FN) (touch FN))))
(add-hook 'after-save-hook 'on-current-buffer-save)
#+END_SRC
* Creating make file
Make file is useful because
1. it allows us to use multi-threading and
2. it simplifies debugging.

When the make file is ready, we launch it with =make -jN ~/.emacs.d/cloud/cloud.mk=, where =N= is the number of CPU cores. 
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(macrolet ((NL () '(push "
" Makefile))
(inl (&rest format-pars) `(progn (push ,(cons 'format format-pars) Makefile) (NL))))
(let (all Makefile uploaded
#+END_SRC
(Already encrypted) gpg-files types are not supposed to be encrypted, and images should be encrypted in a special way.
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(specially-encoded '(
#+END_SRC
Already encrypted (~gpg~) files are just copied
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
("$(cloud)%s.gpg: %s
\tcp $< $@
" "gpg")
#+END_SRC
← this format string requires 2 arguments: =(aref file-record cipher)= and =(aref file-record plain)=.

Make stanza for encrypting an image is more sophisticated:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
("$(cloud)%s.png: %s %s
\tconvert $< -encipher %s%s $@
" "jpg" "jpeg" "png")))
#+END_SRC
← this format string requires 5 arguments:
=(aref file-record cipher)=, =(aref file-record plain)=, =(updated)=,
=(pass-d)=, and (once again) =(aref file-record cipher)=.

Similarly, for decoding
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(specially-decoded '(
("%s: $(cloud)%s.gpg
\tcp $< $@
" "gpg")
("%s: $(cloud)%s.png  %s
\tconvert $< -decipher %s%s $@
" "jpg" "jpeg" "png"))))
#+END_SRC
with the same number of arguments, as for encoding above.

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun cancel-pending-upload(FN) (drop all FN))
(cl-labels ((pass-d () (concat (local-dir) "pass.d/"))
          (updated() (concat (pass-d) "updated")))
#+END_SRC

