cloud.org
** Creating ~make~ stanza for encoding one file
Non-standard case (an image or a ~gpg~-file):
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(cl-flet ((enc-make-stanza(file-record)
(when-let ((XYZ (aref file-record cipher)) (FN (tilda (aref file-record plain))))
(let ((file-ext (file-name-extension FN)))
(concat
(if-let ((fstr (car (find file-ext specially-encoded :key #'cdr :test #'(lambda(x y) (member x y))))))
(format fstr XYZ FN (updated) (pass-d) XYZ)
#+END_SRC
where ~XYZ~ is the (random) 3-symbol cloud name of the file (without extension).

.gz files receive even more special treatment (involving creation of a temporary file):
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(if(string= "gz" file-ext)
(let ((gunzipped (make-temp-file "emacs-cloud.")))
  (format "%s: %s
\tzcat $< > $@

$(cloud)%s.gpg: %s
\t@$(enc) $@ $<
\trm $<
" gunzipped FN XYZ gunzipped))
#+END_SRC

All other files are treated with ~gpg~:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(format "$(cloud)%s.gpg: %s
\t@$(enc) $@ $<
" XYZ FN)))
#+END_SRC
At the end of every file (en/de)coding stanza we send a message to the log file:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(format "\t-echo \"$(date): uploaded %s\" >> $(localLog)
" FN)))))
#+END_SRC
Here ends the function =enc-make-stanza= that produces make-stanza for encoding.

The decoding is similar:
** Creating ~make~ stanza for decoding one file
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(dec-make-stanza(file-record)
(when-let ((XYZ (aref file-record cipher)) (FN (tilda (aref file-record plain))))
(let ((file-ext (file-name-extension FN)))
(concat
(if-let ((fstr (car (find file-ext specially-decoded :key #'cdr :test #'(lambda(x y) (member x y))))))
(format fstr FN XYZ (updated) (pass-d) XYZ)
#+END_SRC

.gz files receive even more special treatment (involving creation of a temporary file):
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(if(string= "gz" file-ext)
(let ((gunzipped (make-temp-file "emacs-cloud.")))
  (format "%s: %s
\tcat $< | gzip > $@

%s:$(cloud)%s.gpg
\t@$(enc) $@ $<
\trm $<
" FN gunzipped gunzipped XYZ))
#+END_SRC

All other files are treated with ~gpg~:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(format "%s: $(cloud)%s.gpg
\t@$(dec) $@ $<
" FN XYZ ))
(format "\t-chgrp %s $@
\t-chmod %o $@
\t-touch --date=%S $@
\t-echo \"$(date): downloaded %s\" >> $(localLog)
" (aref file-record gname) (aref file-record modes) (full-TS (aref file-record mtime)) FN)))))))
#+END_SRC

** Putting this all together
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun download (file-record)
(needs ((FN (aref file-record plain) (clog :error "download: file lacks plain name"))
        (stanza (dec-make-stanza file-record) (clog :error "download: could not create stanza for %s" FN)))
(safe-mkdir (file-name-directory FN))
(push (format " %s" FN) all)
(push stanza Makefile) (NL)))
#+END_SRC

GNU make won't upload (with encryption) the file to the server if target is younger than the dependence.
=make-cloud-older= ensures that the ~.gpg~ file is old enough to prevent this behavior:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun make-cloud-older(file-record)
(when-let ((clouded (get-file-properties (aref file-record cipher)))
           (local-mtime (aref file-record mtime)))
(when (time< local-mtime (aref clouded mtime))
(clog :debug "changing time stamp to %s" (FS (time-add local-mtime -60)))
  (set-file-times
(concat (remote-directory) (plain-name clouded) (cip-ext (plain-name file-record)))
(time-add local-mtime (- -60 (random 6000)))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun upload (file-record)
(needs ((FN (tilda (aref file-record plain)) (clog :error "upload: file lacks plain name"))
	(CN (aref file-record cipher) (clog :error "upload: file %s lacks cipher name" FN))
	(stanza (enc-make-stanza file-record) (clog :error "upload: could not create stanza for %s" FN)))
(clog :debug "started upload(%s)" FN)
(unless (or (member FN uploaded) (member FN *blacklist*))
(push FN upload-queue)
(clog :debug "will add upload(%s) stanza to Makefile" FN)
(make-cloud-older file-record)
(push FN uploaded)
(push (format " %s" (concat (remote-directory) CN
(cip-ext FN)))
all)
(push stanza Makefile) (NL))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun reset-Makefile()
"reseting make file"
(when (or (and (file-exists-p (pass-d)) (file-directory-p (pass-d))) (safe-mkdir (pass-d)))
(setf all nil Makefile nil uploaded nil)
(inl "cloud=%s" remote-directory)
(inl "password=%S" password)
(inl "gpg=gpg --pinentry-mode loopback --batch --yes")
(inl "enc=$(gpg) --symmetric --passphrase $(password) -o")
(inl "dec=$(gpg) --decrypt   --passphrase $(password) -o")
(inl "localLog=%s" (local/log))
(inl "MK=%s" (cloud-mk))
(inl "date=`date '+%%m/%%d %%T'`
")
(inl (concat (format "%s: %s
\tawk '{print $$2 > %S$$1}' $<
\techo $(date) > $@
\t-chgrp -R tmp %s*
" (updated) (image-passes) (untilda (pass-d)) (pass-d))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun save-Makefile()
"flushing make file"
(inl "all:%s
\techo \"background (en/de)cryption on %s finished $(date)\" >> %s
\t@sed 's/%s/******/g' %s > %s.bak
"
(apply #'concat all)
localhost
(history)
password (cloud-mk) (cloud-mk))
(write-region (apply #'concat (reverse Makefile)) nil (cloud-mk)))))))
#+END_SRC

* cloud-sync
=cloud-sync= is the most frequently used function.

We assume that files are changed only within emacs (either edited/saved or removed/renamed using ~dired~), so that
=file-DB= always contains the most recent information about clouded files.
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun cloud-sync()
(interactive)
(let ((ok t))
#+END_SRC
Even if the cloud was changed by some other hosts, information from the file named =(local/all)= is still valuable (for resolving collissions)
and must be loaded at start (when =file-DB= is empty):
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(ifn (cloud-connected-p) (clog :warning "refuse to sync because remote directory not mounted")
#+END_SRC
Before we start doing whatever with the remote directory (shared among several hosts) let us lock it:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(let ((DL (directory-lock (lock-dir) (format "%s
%s" localhost (TS (current-time)))
#+END_SRC
Now if we realize that another host has uploaded changes to the cloud, we should download them:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(when (file-newer-than-file-p (remote-files) (local/all))
  (clog :info "detected NEW %s, will now update %s from it" (remote-files) (local/all))
  (unless (gpg-decrypt (local/all) (remote/files))
    (setf ok (clog :error "could not decrypt file data from the cloud; SHUT DOWN the service and INVESTIGATE!"))))
#+END_SRC
O.k., now when we've got the most recent version of the file =(local/all)=, let us load and parse it:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(unless (read-all (local/all))
 (setf ok (clog :error "could not parse file data just downloaded from the cloud; SHUT DOWN the service and INVESTIGATE!")))
#+END_SRC
If we made any changes before =(cloud-sync)=, let us upload the updates to the cloud:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(when (or added-files upload-queue removed-files)
  (ifn (write-all (local/all)) (setf ok (clog :error "could not save data to %s" (local/all)))
    (gpg-encrypt (local/all) (remote/files))
    (setf added-files nil upload-queue nil removed-files nil)))
#+END_SRC
It is always easier to read local file, so let me make it a little bit younger than the (encrypted) remote one:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(set-file-times (local/all) (current-time))
#+END_SRC
The previous code prepared the make-file; let us call ~GNU make~ now:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(save-Makefile)
(let ((make (format "make -j%d -f %s all &> %s.log" number-of-CPU-cores (cloud-mk) (cloud-mk))))
  (clog :debug "starting %s" make)
  (shell-command make)
  (clog :debug "finished %s" make))
(rm (cloud-mk))
(reset-Makefile))))
#+END_SRC
If director (un)locking fails, we
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(unless (car DL) (setf ok (clog :error "Could not (un)lock remote directory! Please investigate"))))
#+END_SRC
← This is actually rather superficial treatment; in the future we might want to treat this error better based on the information contained in =(cdr DL)=.

Otherwise we proceed in a normal way.
Finally let us print stored messages (printed by =end-log=):
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(dolist (msg (reverse important-msgs)) (message msg))
(setf important-msgs nil)
(clog :info "done syncing")
(write-region (format "%s: %s -- %s
" localhost  (TS (current-time)) (format-time-string "%H:%M:%S" (current-time))) nil (history)))
ok))
#+END_SRC
=cloud-sync= ends here.

Let us =cloud-sync= before the user quits ~emacs~:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun before-exit()
;; (write-conf)
(when (cloud-sync)
  (safe-delete-dir /tmp/cloud/)))
#+END_SRC
#+begin_note
if the connection with the cloud is unstable, an attempt to access the cloud can take more than 10 seconds.
#+end_note

So don't be surprised if quitting emacs takes a long time; the reason for that might be just broken connection to the cloud.
Let it wait for about 30 seconds, and it quits without syncing.
(The waiting time might depend on your [[ssh-config][ssh-configuration]].)

* Actions
By "action" I mean a pending order issued by another host.
For example, suppose that when I yesterday worked on my laptop, I have erased or renamed a file or a directory.
Today I came to my office and I want the same file/directory to be erased/renamed on my office computer.
Yesterday my laptop issued an order to erase/rename that file/directory on every host whoose name is
enumerated in =cloud-hosts=. This order will exist untill all hosts execute it, and then it will be forgotten.

