generated/functions.el

(defun cloud-add(&optional FN)
(interactive)
(if FN (add-file FN)
  (if (string= major-mode "dired-mode")
      (dired-map-over-marks (add-file (dired-get-filename)) nil)
(if-let ((FN (buffer-file-name))) (add-file FN)
    (unless
	(add-file (read-string "file to be clouded=" (if FN FN "")))
      (clog :error "could not cloud this file"))))))

(defun blacklist(FN)
(let ((FN (tilda FN)))
 (cloud-forget-file FN)
(unless (member FN *blacklist*)
 (push FN *blacklist*))))
(defun black-p(FN &optional file-rec)
(let ((result
(or
(member FN *blacklist*) (string-match "tmp" FN)
(string-match (concat ~ ".") (untilda FN))
(member (file-name-extension FN) junk-extensions)
(backup-file-name-p FN)
(when ignored-dirs (string-match(substring(apply #'concat
  (mapcar #'(lambda(d)(format "\\(^%s\\)\\|" d)) ignored-dirs)) 0 -2) FN))
(progn
  (unless file-rec (setf file-rec (get-file-properties FN)))
(when file-rec
  (or
    (member (aref file-rec gname) '("tmp"))
    (< 1000000 (aref file-rec size))))))))
(cons result file-rec)))

(defun white-p(FN &optional file-rec)
(unless file-rec (setf file-rec (get-file-properties FN)))
(cons (member (aref file-rec gname) '("important" "keepOneYear" "keepTwoYears" "keepThreeYears")) file-rec))

(defun add-file(FN &optional file-rec)
(let ((FN (tilda (file-chase-links FN))))
(unless (cloud-locate-FN FN)
(ifn (file-directory-p FN)
  (needs ((GFP (or file-rec (get-file-properties* FN)) (clog :error "Aborting attempt to cloud inexisting file %s" FN))
          (CN (new-file-name remote-directory)))
(push FN added-files)
    (aset GFP cipher CN)
    (push GFP file-DB)
    (clog :debug "add-file/upload: %s(%s)" FN (TS(aref GFP mtime)))
    (upload GFP)
    (when (member (file-name-extension FN) '("jpeg" "png" "jpg"))

(write-region
  (format "%s %s
" CN (rand-str 18)) nil (image-passes) t)
(touch (image-passes))))

(let ((DN (file-name-as-directory FN)))
(dolist (FN (directory-files DN nil nil t))
(unless (member FN '("." ".."))
(let ((FN (concat DN FN)) FR)

(if (or
(let ((r (white-p FN))) (setf FR (cdr r)) (car r))
(not
(let ((r (black-p FN FR))) (setf FR (cdr r)) (car r))))
(add-file FN FR)
(clog :debug "not auto-clouding %s" FN))))))))))

(defun auto-add-file(FN &optional file-rec)
"when the file is clouded automatically"
 (unless (car(black-p FN file-rec)) (add-file FN file-rec)) t)

(defun cloud-forget-file (local-FN); called *after* the file has already been sucessfully deleted
  (needs ((DB-rec (or (cloud-locate-FN local-FN) (old-cloud-locate-FN local-FN))
 (clog :warning "forget: doing nothing since %s is not clouded" local-FN))
          (CEXT (cip-ext local-FN))
	  (cloud-FN (concat (remote-directory) (aref DB-rec cipher) CEXT) (clog :error "in DB entry for %s" local-FN)))
(cancel-pending-upload local-FN)

(when (string= CEXT ".png")
(clog :debug "forgetting password for %s" local-FN)
  (forget-password (aref DB-rec cipher)))

(drop file-DB DB-rec)
(push local-FN removed-files)
(if (car (safe-dired-delete cloud-FN))
  (clog :info "erased %s" cloud-FN)
  (clog :warning "could not erase %s" cloud-FN))
 t))

(defun cloud-forget-recursive(FN)
(clog :debug "cloud-forget-recursive(%s)" FN)
(new-action i-forget FN)
(dolist (sub-FN (mapcar #'plain-name (contained-in FN)))
  (cloud-forget-file sub-FN))
(cloud-forget-file FN))

(defun cloud-forget (&optional FN)
  (interactive)
(if FN (cloud-forget-recursive FN)
  (if (string= major-mode "dired-mode")
      (dired-map-over-marks (cloud-forget-recursive (dired-get-filename)) nil)
(if-let ((FN (buffer-file-name))) (cloud-forget-recursive FN)
    (unless
	(cloud-forget-recursive (read-string "file to be forgotten=" (if FN FN "")))
      (clog :error "could not forget this file"))))))

(defun cloud-rename-file(old new)
  (let ((source (cloud-locate-FN old))
        (target (cloud-locate-FN new)))
    (cond
     ((and source target); overwriting one cloud file with another one
      (dolist (property (list mtime modes gname))
            (aset target property (aref source property)))
      (drop file-DB source))
     (source (aset source plain new))
     (target (setf target (get-file-properties* new))))))

(defun dired-rename-file (old-FN new-FN ok-if-already-exists)
  (let (failure)
    (clog :debug "DRF")
    (condition-case err
	(funcall DRF old-FN new-FN ok-if-already-exists)
      (file-error
       (clog :error "DRF error!")
       (message "%s" (error-message-string err))
       (setf failure t)))
    (unless failure
      (clog :debug "cloud-rename-file %s --> %s" old-FN new-FN)
      (cloud-rename-file old-FN new-FN)
      (new-action i-rename old-FN new-FN)

(when (file-directory-p old-FN)
  (let* ((old-dir (file-name-as-directory old-FN)) (LOD (length old-dir))
         (new-dir (file-name-as-directory new-FN)))
    (dolist (rec (contained-in old-FN))
      (let ((FN (aref rec plain)))
        (when (and (<= LOD (length FN))
	     (string= old-FN (substring FN 0 LOD)))
	  (let ((new-name (concat new-dir (substring FN LOD))))
            (cloud-rename-file FN new-name)
	    (new-action i-rename FN new-name))))))))))

(defun rename-directory (old-dir new-dir)
"recursively update plain-names of clouded files due to renaming of a directory"
(when (file-directory-p old-dir)
  (let* ((old-dir (file-name-as-directory old-dir)) (LOD (length old-dir))
         (new-dir (file-name-as-directory new-dir)))
    (dolist (rec (contained-in old-dir))
      (let ((FN (aref rec plain)))
        (when (and (<= LOD (length FN))
		   (string= old-dir (substring FN 0 LOD)))
	  (aset rec plain (concat new-dir (substring FN LOD)))))))))
